"""" 规则 """
# 辅助规则
assist_rules = [
    ['[(（]1[）)].*?[:：]', '\n[(（][1-9][0-9]?[）)].*?[:：]', '\n[(（][1-9][0-9]?[）)](.*?)[:：]'],
    ['：', '\n.*?：', '\n(.*?)：']
]


class BaseCollege:
    """ 父类，存放所有配置 """
    rules = []                  # 该学校文档通用规则
    key_rules = []              # 标题的处理层级。格式为[["key_name", number]] number : 0 直接返回 1 解析一层 2 解析两层 n 解析n层
    new_rules = []              # 标题新的匹配规则。格式为[["key_name", rules]]
    tables_key_rules = []       # 格式为[type, ["key_name"], number] type : 0 横 1 纵 number : 0 取到表格尾 n 取n行


class skz_rcpy(BaseCollege):
    """ 山科职 """
    rules = [  # 通用规则
        ['第[一二三四五六七八九十]部分', '第[一二三四五六七八九十]部分.*?\n', '第[一二三四五六七八九十]部分(.*?)\n'],
        ['一、', '\n[一二三四五六七八九十]、.*?\n', '\n[一二三四五六七八九十]、(.*?)\n'],
        ['[(,（]一[）,)]', '[(,（][一二三四五六七八九十][）,)].*?\n', '[(,（][一二三四五六七八九十][）,)](.*?)\n'],
        ['1\\..*?[：,:][^1-9]', '[1-9]\\d*\\..*?[：,:]', '[1-9]\\d*\\.(.*?)[：,:]'],
        ['1\\.', '\n[1-9]\\d*\\..*?\n', '\n[1-9]\\d*\\.(.*?)\n'],
        ['[：,:][^1-9]', '\n.*?[：,:]', '\n(.*?)[：,:]'],
        ['（1）', '（[1-9]\\d*）.*?\n', '（[1-9]\\d*）(.*?)\n']
    ]


class sz_rcpy(BaseCollege):
    """ 商职 """
    rules = [
        ['[一二三四五六七八九十][一二三四五六七八九]?、', '\n[一二三四五六七八九十][一二三四五六七八九]?、.*?\n', '\n[一二三四五六七八九十][一二三四五六七八九]?、(.*?)\n'],
        ['[(（]一[）)]', '[(（][一二三四五六七八九十][一二三四五六七八九]?[）)].*?\n', '[(（][一二三四五六七八九十][一二三四五六七八九]?[）)](.*?)\n'],
        ['1[\\.．]', '\n[1-9][0-9]?[\\.．].*?\n', '\n[1-9][0-9]?[\\.．](.*?)\n'],  # 特殊字符．
        ['[(（]1[）)]', '\n[(（][1-9][0-9]?[）)].*?\n', '\n[(（][1-9][0-9]?[）)](.*?)\n'],
        # (1)与1)，不会出现冲突
        ['1）', '\n[1-9][0-9]?）.*?\n', '\n[1-9][0-9]?）(.*?)\n'],
        # ['：', '\n.*?：', '\n(.*?)：']
    ]

    new_rules = [  # 新规则。注意：如果从列表中取规则要使用切片的方式，哪怕只是一条规则，否则可能因为格式而报错
        ['.*专业名称.*', rules[0:1] + assist_rules[1:2]],
        ['.*教育类型及学历层次.*', rules[0:1] + assist_rules[1:2]],
        ['.*所在专业（群）人才培养模式及专业（群）课程体系.*', rules[0:1]],
        ['.*职业岗位核心能力分析及专业核心课程.*', rules[0:1]],
        ['.*课程体系.*', rules[0:1]],
        ['.*实践教.*', rules[0:1]],
        ['.*创新创业教.*', rules[0:1]],
        ['.*素质教.*', rules[0:1]],
        ['.*毕业标准.*', rules[0:1]],
        ['.*师资条件.*', rules[1:2]],
        ['.*教学设施.*', rules[1:2]],
        ['.*校企合作.*', rules[1:2]],
        ['.*学习资源.*', rules[1:2]]
        # [ '素质目标', ini_rules_new[:3] + assist_rules[:1] + ini_rules_new[4:] ],
        # [ '能力目标', ini_rules_new[:3]]
    ]

class skz_skjh(BaseCollege):
    rules = [
        ['\n.*授课进度计划|学期授课总要求|教学进度表|作.*?业.*?设.*?计.*?题.*?册|作业设计题目表|课程考核改革方案说明表'
            , '\n\n.*授课进度计划|学期授课总要求|教学进度表|作.*?业.*?设.*?计.*?题.*?册|作业设计题目表|课程考核改革方案说明表\n'
            , '(\n.*授课进度计划|学期授课总要求|教学进度表|作.*?业.*?设.*?计.*?题.*?册|作业设计题目表|课程考核改革方案说明表.*?)\n'],
        ['[：,:][^1-9]', '[\n\s].*?[：,:]', '[\n\s]\n(.*?)[：,:]'],
    ]
    skz_skjh_assist_rules = [
        ['课程名称|适用班级|订计划人|专业主任|系、部负责人|上课周数|每周时数|学期时数|理论教学|实验教学|现场教学|多媒体授课时数|过程考核次数'
            , '课程名称\s*[:：]?\s*|适用班级\s*[:：]?\s*|订计划人\s*[:：]?\s*|专业主任\s*[:：]?\s*|系、部负责人\s*[:：]?\s*|上课周数\s*[:：]?\s*|每周时数\s*[:：]?\s*|学期时数\s*[:：]?\s*|理论教学\s*[:：]?\s*|实验教学\s*[:：]?\s*|现场教学\s*[:：]?\s*|多媒体授课时数\s*[:：]?\s*|过程考核次数\s*[:：]?\s*'
            , '(课程名称|适用班级|订计划人|专业主任|系、部负责人|上课周数|每周时数|学期时数|理论教学|实验教学|现场教学|多媒体授课时数|过程考核次数)\s*[:：]?\s*']
    ]

    new_rules = [
        ['.*授课进度计划', rules[0:1] + skz_skjh_assist_rules[0:1]]
    ]
# 学校的对应关系
college_relationship = {
    '山东科技职业学院': {
        'rcpy': skz_rcpy(),
        'skjh': skz_skjh()
    },
    '山东商业职业技术学院': {
        'rcpy': sz_rcpy()
    }
}
